<?php

$h = date('H');
$i = date('i');
$s = date('s');

if ($h == 1 || $h == 21){
    echo "$h час ";
} elseif ($h >4 && $h < 21) {
    echo "$h часов ";
}  else {
    echo "$h часа ";
}

if ($i == 1 || $i == 21 || $i == 31 || $i == 41 || $i == 51){
    echo "$i минута ";
} elseif ($i >4 && $i < 21 || $i >24 && $i < 31 || $i >34 && $i < 41 || $i >44 && $i < 51 || $i >54 && $i < 61) {
    echo "$i минут ";
}  else {
    echo "$i минуты ";
}

if ($s == 1 || $s == 21 || $s == 31 || $s == 41 || $s == 51){
    echo "$s секунда ";
} elseif ($s >4 && $s < 21 || $s >24 && $s < 31 || $s >34 && $s < 41 || $s >44 && $s < 51 || $s >54 && $s < 61) {
    echo "$s секунд ";
}  else {
    echo "$s секунды ";
}

?>




